#include <stdio.h>
// 課題2
//     whileを使用して勉強会2回目のプログラムに下記の変更を行ってください。
//     「ターミナルから任意の個数の数字（小数を含む場合有り）を入力し、、その和と積と平均の計算結果をターミナルに表示させる。
//     入力を中止するには、Ctrl+d（Ctrlボタンを 押しながらdボタンを押す）で行うものとする。」
//     期待する結果の例（ターミナル上の表示内容）
//     数値を入力してください。
//     1つ目の数字を入力してください＞1　（ターミナルで1を入力）
//     2つ目の数字を入力してください＞2　（ターミナルで2を入力）
//     3つ目の数字を入力してください＞3　（ターミナルで3を入力）
//     （ターミナルでctrl+dを入力）
//     和は「6.0」です。
//     積は「6.0」です。
//     平均は「2.0」です。

double f(double n, int i)
{
    for (;;)
    {
        if (1 <= n && n <= 10)
        {
            printf("%dつ目の整数を入力してください。＞", i);
            return n;
        }
        else
        {
            printf("1～10以外の数字が入力されました。\n");
        }
    }
    return 0;
}

int main(void)
{
    double n = 0;
    int i = 1;
    double sum = 0;
    double mul = 1;
    printf("Ctrl+Dで結果を計算結果(和, 積, 平均)を出力します。\n");
    printf("%dつ目の数値を入力してください。＞", i);
    while (scanf("%lf", &n) != EOF)
    {
        i++;
        n = f(n, i);
        sum += n;
        mul *= n;
    }
    printf("\n");
    printf("和は「%.1f」です。\n", sum);
    printf("積は「%.1f」です。\n", mul);
    printf("平均は「%.1f」です。\n", sum / (i - 1));
    return 0;
}
